<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"824ff96346bfa006819225be71e586c454eea8fa2a2db0791f03b06628de63c5","plan_job_ref":"Job Pull Request Checks #3668 at https://github.com/GSA-TTS/FAC/actions/runs/10962978069","plan_out_hash":"efb6e6b6763f497a7065b8a19bb64e13be6bbf0922ba518e7d1209b7a9885b1a","plan_hash":"6526cafea9fc1ae300ec219fe7ff3d04beca37122ba863b0c3f98ab2057e3a35","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["sandbox"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../sandbox/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.main-tf will be created
+   resource "local_file" "main-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            # Add resources to this module describing what you want in the corresponding 
            # space in cloud.gov. You should probably just reference a shared module as in the
            # example below to keep consistency across spaces, but you can also vary the 
            # content for each environment as needed.
            
            module "sandbox" {
              source        = "../shared/modules/env"
              cf_space_name = "sandbox"
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/sandbox.tf-example"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.variables-tf will be created
+   resource "local_file" "variables-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            variable "cf_user" {
              type        = string
              description = "cloud.gov deployer account user"
            }
            
            variable "cf_password" {
              type        = string
              description = "secret; cloud.gov deployer account password"
              sensitive   = true
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/variables-managed.tf"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3668](https://github.com/GSA-TTS/FAC/actions/runs/10962978069)